Autodesk.Revit.DB.Transform1D.Multiply(Autodesk.Revit.DB.Transform1D)
Multiplies this transformation by the specified transformation and returns the result.
Remarks:
The combined transformation has the same effect as applying the input transformation first, and this transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).
right:
The input transformation.
Returns:
The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform1D.Assign(Autodesk.Revit.DB.Transform1D)
Assigns values from the input transformation to this transformation.
from:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform1D.AlmostEqual(Autodesk.Revit.DB.Transform1D)
Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Remarks:
The tolerance is applied memberwise for comparison.
right:
The transformation to compare with this transformation.
Returns:
True if the two transformations are equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform1D.#ctor(Autodesk.Revit.DB.Transform1D)
The copy constructor.
other:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021